//Задача 41: Пользователь вводит с клавиатуры M чисел. 
//Посчитайте, сколько чисел больше 0 ввёл пользователь.
/*
Console.Write("Enter of numbers: ");
int m = Convert.ToInt32(Console.ReadLine());
int count = 0;

for(int i = 0; i < m; i++)
{
    Console.WriteLine("Input a number: ");
    int num = Convert.ToInt32(Console.ReadLine());

    if(num > 0)
        count++;
}
Console.WriteLine($"Positive numbers: {count}");
*/
/*
//Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, 
//заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; 
//значения b1, k1, b2 и k2 задаются пользователем.
// x = (b2 - b1) / (k1 - k2)
// y = k1 * x + b1
// y = k2 * x + b2 

Console.WriteLine("Input a number b1: ");
double b1 = Convert.ToDouble(Console.ReadLine());
Console.WriteLine("Input a number k1: ");
double k1 = Convert.ToDouble(Console.ReadLine());
Console.WriteLine("Input a number b2: ");
double b2 = Convert.ToDouble(Console.ReadLine());
Console.WriteLine("Input a number k2: ");
double k2 = Convert.ToDouble(Console.ReadLine());

double x = (b2 - b1) / (k1 - k2);
double y = k1 * x + b1;

Console.WriteLine($"Intersection point coordinate: {x}, {y}");
*/


